#ციკლები!

#ციკლი არის ერთი და იგივე ოპერაციის შესრულება რამდენჯერმე.

for i in range(1,20, 2):
    print(i)

    # for ციკლის შესაქმნელად საჭირო keyword.
    # i - საიტერაციო ცვლადი (იტერაცია ნიშნავს განმეორებას), საიტერაციო ცვლადს შეგვიძლია მივანიჭოთ ნებისმიერი სახელი.
    # in - ში
    # range - დიაპაზონი. 
    # range ფუნქციას გადაეცემა 3 არგუმენტი (start, end, step), თუ ჩვენ მას გადავცემთ მხოლოდ ერთ არგუმენტს, იგი ავტომატურად მიიღებს end - ის მნიშვნელობას, start ავტომატურად იქნება 0 - ის ტოლი ხოლო step ავტომატურად იქნება 1 - ის ტოლი.


i = 0
while i < 41:
    print(i)
    i = i + 1 

    # i - საიტერაციო ცვლადის დეკლარაცია.
    # while - ციკლის შესაქმნელად საჭირო keyword. (სანამ)
    # ციკლი იმუშავებს მანამდე სანამ i ნაკლებია 41-ზე.
    # თითოეულ დატრიალებაზე დაიპრინტება საიტერაციო ცვლადი i, რომელიც ყოველ გამეორებაზე იცვლის მნიშვნელობას.
    # i = i + 1 ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა)
    
#ფუნქციები!

#ზოგადად ფუნქცია არის ის რაც ასრულებს რაღაც მოქმედებას იმდენჯერ, რამდენჯერაც მომხმარებელი ისურვებს. 

def func():
    for i in range(10):
        print(i)  

# ფუნქციის შესაქმნელად ვიყენებთ def keyword - ს.
# def keyword - ის შემდეგ გადავცემთ ფუნქციის სახელს და ბოლოში ფრჩხილებს, რომელშიც ფუნქციას გადაეცემა არგუმენტები/პარამეტრები. 
# ფუნქცია არ იმუშავებს გამოძახების გარეშე, გამოძახებისთვის კი საკმარისია უბრალოდ დავწეროთ ფუნქციის სახელი და ფრჩხილები არგუმენტებით(თუ გვაქვს)

def welcome(name):
    print("Hello, " + name + "!")

    #ეს არის მისალმების ფუნქცია, რომელსაც გადაეცემა 1 არგუმენტი/პარამეტრი (name). გამოძახებისას ფრჩხილებში რა მნიშვნელობასაც ჩავწერთ, ის მნიშვნელობა ჩაჯდება ქვემოთ, პრინტ ფუნქციაში და გამოვა ისე, რომ ფუნქცია მოგვესალმება.







        #     რა მოვალეობები გაქვს როგორც რაზმის ლიდერს? 
        # 1. ყოველკვირა უნდა მივწეროთ მშობელს.
        # 2. ყოველთვის უნდა გვქონდეს ინტერნეტი ტელეფონში, რომ ვუპასუხოთ ბავშვს იმ შემთხვევაში თუ არ გვცალია. 
        # 3. ლიდერებმა უნდა ისწავლონ ბევრი, უნდა იცოდნენ რაზმელებზე მეტი. 
        # 4. უნდა გავიუმჯობესოთ ახსნის უნარი. 
        # 5. ყოველ 5-6 ბავშვზე უნდა ავიყვანოთ 1 მინი-ლიდერი. 
        # 6. უნდა დავხვეწოთ ჩვენი გითჰაბი.
        # 7. უნდა ვაკეთოთ ბევრი პროექტები, გამოცდილების შესაძენად. 
        # ლიდერთა კონტროლის დეპარტამენტი: 
        # თუ ლიდერი კარგად გააკეთებს ყველაფერს, მიიღებს ბონუსს ხელფასზე. თუ დაუშვებს ბევრ შეცდომას (რაც ახალბედებს ახასიათებთ და ამის გამო არ დანებდე) პირიქით, დაჯარიმდება და მოაკლდება ხელფასი. 
        # დავიწყოთ ბარათებით. რა არის ბარათი და როგორ შეგიძლია მისი მოპოვება? 
        # ლიდერთა კონტროლის დეპარტამენტში გვაქვს 4 სახის ბარათი. იასამნისფერი, ყვითელი, შავი და მწვანე. 
        # ცუდი ბარათები - იასამნისფერი(🟪), ყვითელი(🟨), შავი(⬛). 
        # კარგი ბარათი - მწვანე(🟩). 
        # ბარათების ურთიერთდამოკიდებულება: 
        # 3 იასამნისფერი(🟪) == 1 ყვითელი(🟨) 
        # 2 ყვითელი(🟨) == 1 შავი(⬛) 
        # 1 მწვანე(🟩) == -1 იასამნისფერი (🟪) (ანუ მწვანე ბარათი (🟩) გიბათილებს 1 იასამნისფერ ბარათს (🟪), აქედან გამომდინარეობს რომ 1 ყვითლის (🟨) გასაბათილებლად 3 მწვანე (🟩) გჭირდება, 1 შავის (⬛) გასაბათილებლად კი 6 (🟩)). 
        # როგორ მუშაობს ეს ბარათები: 
        # თვის ბოლოს, ზემოთ მოცემული წესების მიხედვით გაგიბათილდება ბარათები და დაგეწერება საბოლოო შედეგი, შემდეგ კი რაც დაგრჩება იმოქმედებს შენს ხელფასზე. 
        # ცუდი ბარათები გაკლებს ხელფასს, კარგი გიმატებს. 
        # იასამნისფერი (🟪) == -10% ხელფასიდან 
        # 2 იასამნისფერი (🟪) == -15% ხელფასიდან 
        # ყვითელი (🟨) == -20% ხელფასიდან 
        # შავი (⬛) == -50% ხელფასიდან 
        # 1 მწვანე (🟩) == +X ლარი ხელფასზე 
        # როგორ კონტროლდებიან ლიდერები? 
        # 1. ყოველთვიურათ ლიდერებს აქვთ 3 გამოცდა.
        # 1.1 პირველი გამოცდა იქნება ჩვეულებრივი პროგრამირების გამოცდა. ამ სამიდან რომელიმე: Codewars/Kahoot/Project. რომელი იქნება ამას რაზმის ლიდერთა კონტროლიორები გადაწყვიტავენ მინიმუმ 1 კვირით ადრე და შეგატყობინებენ მწვანე ჩატში (GOA INFO - რაზმის ლიდერებისთვის). 
        # 1.2 მეორე გამოცდა იქნება ახსნის გამოცდა. ეს გამოცდები ჩატარდება ინდივიდუალურად ყველა ლიდერთან (სხვების დასწრება არ შეიძლება). კონტროლიორი რომელიმე ვოისში შემოგიყვანს, დაგისვამს კითხვებს, აგახსნევინებს რაიმე მასალას და საბოლოოდ გადაწყვიტავს რომელ ბარათს მიიღებ. 
        # 1.3 მესამე გამოცდა იქნება იგივენაირი როგორიც პირველი, ოღონდ წინა გამოცდის საკითხი არ გამეორდება. ანუ მაგალითად თუ უკვე იყო codewars, მეორედ აღარ იქნება. 
        # დამატებითი ინფორმაცია: პირველი და მესამე გამოცდის დროს კონტროლიორი ჩააგდებს ჩატში Google Spreadsheet'ს (ანუ ცხრილს), რომელიც დასრულების შემდეგ უნდა შეავსო (უნდა იპოვო შენი სახელი და მის გვერდზე ჩასვა "საჭირო ლინკი"). 
        # 2. ყოველ 2 კვირაში არის მშობლების ჩატების შემოწმება, რისთვისაც ვწერთ 5-10 წუთიან ვიდეოს, სადაც ვსქროლავთ ჩათებს და ვხსნით ამავდროულად იმ ბავშვის მდგომარეობას, რომლის მშობლის ჩათიც გვექნება გახსნილი.
        # ვიდეოს წესები: 
        # 2.1 შენი ხმა უნდა ისმოდეს კარგად. 
        # 2.2 ვიდეოს ხარისხი უნდა იყოს საკმარისი იმისთვის რომ კონტროლიორმა დაინახოს როდის მიწერე და რა მიწერე მშობელს (წინააღმდეგ შემთხვევაში არ შემოწმდები და დაჯარიმდები ყვითელი/შავი ბარათით). 
        # 2.3 ჩატებს და დროებს არ უნდა ეფარებოდეს არაფერი რადგან კონტროლიორმა შეძლოს შენი სრულფასოვნად შემოწმება (წინააღმდეგ შემთხვევაში არ შემოწმდები და დაჯარიმდები ყვითელი/შავი ბარათით). 
        # 2.4 წინასწარ უნდა გქონდეს გახსნილი რამდენიმე მშობლის ჩატი. თუ გყავს 20-25+ რაზმელი მაშინ ჯერ გახსენი მშობლების ნაწილის ჩატები, ჯერ დაარექორდე ეგენი, ილაპარაკე, რომ დაამთავრებ დააპაუზე ჩანაწერი, გახსენი დანარჩენი მშობლების ჩატები და შემდეგ გააგრძელე ჩანაწერი. (ანუ ჩანაწერი არ უნდა იყოს სავსე ჩატვირთვაში ლოდინით და ჩატების გახსნით) 
        # 2.5 GOA'ს ჩანაწერების gmail'ზე შეიქმნება რაიმე ფოლდერი სადაც უნდა ატვირთოთ თქვენი ჩანაწერი განსაზღვრულ დროში (ამაზე ინფორმაცია დაიწერება შემოწმების დაწყებისას და მანამდეც) 
        # 2.6 "ჩატი არ გაიხსნა" არ ითვლება, მოძებნე გზა რითიც გახსნი და დაამტკიცებ რომ მშობელს წერდი. 
        # 3. ყოველთვიურად არის პროექტების შემოწმება, Coding Interview'ს სახით. მთელი თვის განმავლობაში გაქვს დრო, რომ გააკეთო პროექტები და თვის ბოლოსკენ წარმოადგინო კონტროლიორთან. 
        # 3.1 პროექტი უნდა იყოს რთული გასაკეთებელი შენი დონისთვის, ანუ უმეტესად dice roll თამაში და კალკულატორი არ ითვლება (პირდაპირ გაგინულდება პროექტი). 
        # 3.2 რასაც დაწერ, მთლიანი კოდის ახსნა უნდა შეგეძლოს ისე რომ პატარა ბავშვმაც გაიგოს. 
        # 3.3 პროექტების ლიმიტი არის 3. (თუ არ არის განსაკუთრებული შემთხვევა და თუ ასე იქნება, აუცილებლად შეგატყობინებენ ლიდერთა კონტორლის დეპარტამენტის წარმომადგენლები). 
        # 4. ასევე დამატებით თუ შევნიშნავთ რომ რამეს აშავებთ და არ აქცევთ ბავშვებს ყურადღებას, დაგეწერებათ ჯარიმა.